Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_gateway_response.default_4xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_4xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_gateway_response.default_5xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_5xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "bxydsv" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_group.manual_carousel_step_function_log_group will be created
+ resource "aws_cloudwatch_log_group" "manual_carousel_step_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/states/manual_carousel_workflow"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
    }

  # aws_cloudwatch_log_group.render_carousel will be created
+ resource "aws_cloudwatch_log_group" "render_carousel" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/render_carousel"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
    }

  # aws_ecs_task_definition.render_carousel will be created
+ resource "aws_ecs_task_definition" "render_carousel" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "python",
                      + "lambda_function.py",
                    ]
                  + environment      = [
                      + {
                          + name  = "EVENT_JSON"
                          + value = ""
                        },
                      + {
                          + name  = "FFMPEG_PATH"
                          + value = "/opt/bin/ffmpeg"
                        },
                      + {
                          + name  = "TARGET_BUCKET"
                          + value = "prod-sharedservices-artifacts-bucket"
                        },
                    ]
                  + image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_carousel@sha256:c95449aaeb0d5a19379f10b838225abba9d27f52e37736a069ae0fcf1164e571"
                  + linuxParameters  = {
                      + initProcessEnabled = true
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/render_carousel"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/mnt/efs"
                          + readOnly      = false
                          + sourceVolume  = "efs"
                        },
                    ]
                  + name             = "render_carousel"
                  + ulimits          = [
                      + {
                          + hardLimit = 65536
                          + name      = "nofile"
                          + softLimit = 65536
                        },
                    ]
                },
            ]
        )
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role"
      + family                   = "render_carousel"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + task_role_arn            = "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role"
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "efs"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0e0f22150227b252a"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0

              + authorization_config {
                  + access_point_id = "fsap-076e0e4723ceab689"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_iam_role.lambda_role will be updated in-place
~ resource "aws_iam_role" "lambda_role" {
        id                    = "sharedservices_lambda_role"
      ~ max_session_duration  = 43200 -> 3600
        name                  = "sharedservices_lambda_role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (12 unchanged blocks hidden)
    }

  # aws_iam_role.step_functions_role will be updated in-place
~ resource "aws_iam_role" "step_functions_role" {
        id                    = "sharedservices_step_functions_role"
      ~ max_session_duration  = 43200 -> 3600
        name                  = "sharedservices_step_functions_role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_iam_role_policy.create_feed_post_start_carousel will be created
+ resource "aws_iam_role_policy" "create_feed_post_start_carousel" {
      + id          = (known after apply)
      + name        = "create-feed-post-start-carousel"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sharedservices_lambda_role"
    }

  # aws_iam_role_policy.ecs_task_sendtask_carousel will be created
+ resource "aws_iam_role_policy" "ecs_task_sendtask_carousel" {
      + id          = (known after apply)
      + name        = "ecs-task-sendtask-carousel"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "states:SendTaskSuccess",
                          + "states:SendTaskFailure",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowStepFunctionsCallbacks"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod-sharedservices-artifacts-bucket",
                          + "arn:aws:s3:::prod-sharedservices-artifacts-bucket/*",
                        ]
                      + Sid      = "AllowS3ReadWriteCarousel"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sharedservices_ecs_task_role"
    }

  # aws_iam_role_policy.step_functions_policy will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_policy" {
        id          = "sharedservices_step_functions_role:sharedservices_step_functions_policy"
        name        = "sharedservices_step_functions_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "lambda:InvokeFunction",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:lambda:us-east-2:825765422855:function:get_logo",
                            "arn:aws:lambda:us-east-2:825765422855:function:delete_logo",
                            "arn:aws:lambda:us-east-2:825765422855:function:notify_post",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                          - "ecs:RunTask",
                          - "ecs:StopTask",
                          - "ecs:DescribeTasks",
                          + "logs:CreateLogDelivery",
                          + "logs:GetLogDelivery",
                          + "logs:UpdateLogDelivery",
                          + "logs:DeleteLogDelivery",
                          + "logs:ListLogDeliveries",
                          + "logs:PutResourcePolicy",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                        ]
                      ~ Resource = [
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:6",
                          - "arn:aws:ecs:us-east-2:825765422855:task-definition/weekly_news_recap:33",
                        ] -> "*"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DescribeRule",
                          + "events:RemoveTargets",
                          + "events:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:*:*:rule/StepFunctionsGetEventsForECSTaskRule*"
                    },
                  + {
                      + Action   = [
                          + "ecs:RunTask",
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:us-east-2:825765422855:task-definition/render_video:6"
                    },
                    {
                        Action    = "iam:PassRole"
                        Condition = {
                            StringEquals = {
                                "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = [
                            "arn:aws:iam::825765422855:role/sharedservices_ecs_exec_role",
                            "arn:aws:iam::825765422855:role/sharedservices_ecs_task_role",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.create_feed_post will be updated in-place
~ resource "aws_lambda_function" "create_feed_post" {
        id                             = "sharedservices-create-feed-post"
        tags                           = {}
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "FEEDUTOPIA_API_KEY" = (sensitive value)
              - "NEWS_TABLE"         = "weekly_news_posts"
              - "UPLOAD_BUCKET"      = "prod-sharedservices-artifacts-bucket"
            } -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_sfn_state_machine.manual_carousel_workflow will be created
+ resource "aws_sfn_state_machine" "manual_carousel_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "manual_carousel_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + region                    = "us-east-2"
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::825765422855:role/sharedservices_step_functions_role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = (known after apply)
        }

      + tracing_configuration (known after apply)
    }

Plan: 6 to add, 7 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 6 to add, 7 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```